src/cfe/КСП/InformationRegisters/КСП_ИсходныеДанныеЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ИсходныеДанныеЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>json</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>site</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Catalogs/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПодарочныеСертификаты</Name>
			<Owners>
				<xr:Item>Catalog.ВидыПодарочныхСертификатов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_ШтрихкодЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МагнитныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/CommonModules/КСП_ЭкспортСлужебный/Ext/Module.bsl
Функция ПолучитьСвойствоОбъекта(СсылкаНаОбъект,Свойство) 
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ
		|	Элемент.(Свойство) КАК Свойство
		|ИЗ
		|	(Объект) КАК Элемент
		|ГДЕ
		|	Элемент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ПолноеИмяОбъектаМетаданных = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	
	Текст = СтрЗаменить(Текст,"(Объект)",ПолноеИмяОбъектаМетаданных);
	Текст = СтрЗаменить(Текст,"(Свойство)",Свойство);
	
	Запрос.Текст = Текст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат  ВыборкаДетальныеЗаписи.Свойство;
	КонецЦикла;
	
КонецФункции	
	
Функция СоздатьУзелIdentification(СсылкаНаОбъект) Экспорт

	// Проверка заполнения делается в вызываемых методах!!!!!!
	//Если СсылкаНаОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
	//	Возврат Новый Структура;
	//КонецЕсли;

	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелIdentification_Перечисления(СсылкаНаОбъект);
		
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелIdentification_Справочника(СсылкаНаОбъект);
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелIdentification_Документа(СсылкаНаОбъект);

	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелIdentification_ПВХ(СсылкаНаОбъект);

	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции


Функция СоздатьУзелIdentification_Перечисления(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура("type", "");
	
	Если СсылкаНаОбъект = Неопределено или СсылкаНаОбъект = null Тогда                          
		Возврат ОтветСтруктура;
	КонецЕсли;

	ОтветСтруктура.type = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	
	Если не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("Значение", НайтиЗначениеПеречисленияПоПредставлению(СсылкаНаОбъект));
	ОтветСтруктура.Вставить("Представление", Строка(СсылкаНаОбъект));
	
	Возврат ОтветСтруктура;
	
КонецФункции                                         

Функция СоздатьУзелIdentification_Справочника(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура("type", "");
	
	Если СсылкаНаОбъект = Неопределено или СсылкаНаОбъект = null Тогда                          
		Возврат ОтветСтруктура;
	КонецЕсли;

	мд = СсылкаНаОбъект.метаданные();
	type = мд.ПолноеИмя();	
	ОтветСтруктура.type = type;
	
	Если не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("Ref", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
	ОтветСтруктура.Вставить("Version", ПолучитьСвойствоОбъекта(СсылкаНаОбъект,"ВерсияДанных"));
	
	Если type = "Справочник.Валюты" Тогда
		ОтветСтруктура.Вставить("currencyCode", СсылкаНаОбъект.Код);	
		ОтветСтруктура.Вставить("currencyName", СокрЛП(СсылкаНаОбъект.Наименование));	
		
	ИначеЕсли type = "Справочник.БанковскиеСчетаОрганизаций" Тогда
		ОтветСтруктура.Вставить("НомерСчета", СокрЛП(СсылкаНаОбъект.НомерСчета));
		БИК = "";
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Банк) И ЗначениеЗаполнено(СсылкаНаОбъект.Банк.ВерсияДанных)  Тогда
			БИК = СокрЛП(СсылкаНаОбъект.Банк.Код);
		КонецЕсли;
		ОтветСтруктура.Вставить("БИК", БИК);	
		
	ИначеЕсли type = "Справочник.БанковскиеСчетаКонтрагентов" Тогда
		ОтветСтруктура.Вставить("НомерСчета", СокрЛП(СсылкаНаОбъект.НомерСчета));
		БИК = "";
		Если ЗначениеЗаполнено(СсылкаНаОбъект.Банк) И ЗначениеЗаполнено(СсылкаНаОбъект.Банк.ВерсияДанных)  Тогда
			БИК = СокрЛП(СсылкаНаОбъект.Банк.Код);
		КонецЕсли;
		ОтветСтруктура.Вставить("БИК", БИК);	
		
	ИначеЕсли type = "Справочник.КартыЛояльности" Тогда
		ОтветСтруктура.Вставить("Штрихкод", СокрЛП(СсылкаНаОбъект.Штрихкод));
		ОтветСтруктура.Вставить("МагнитныйКод", СокрЛП(СсылкаНаОбъект.МагнитныйКод));	

	ИначеЕсли type = "Справочник.СтавкиНДС" Тогда
		ОтветСтруктура.Вставить("ПеречислениеСтавкаНДС", СоздатьУзелIdentification_Перечисления(СсылкаНаОбъект.ПеречислениеСтавкаНДС));
		
	ИначеЕсли type = "Справочник.УпаковкиЕдиницыИзмерения" Тогда
		ОтветСтруктура.Вставить("Наименование", СокрЛП(СсылкаНаОбъект.Наименование));

	ИначеЕсли type = "Справочник.СерииНоменклатуры" Тогда
		ОтветСтруктура.Вставить("СерияНомер", СокрЛП(СсылкаНаОбъект.Номер));

	ИначеЕсли type = "Справочник.ПодарочныеСертификаты" Тогда
		ОтветСтруктура.Вставить("Номинал", СокрЛП(СсылкаНаОбъект.Владелец.Номинал));

	ИначеЕсли type = "Справочник.ХарактеристикиНоменклатурыДляЦенообразования" Тогда 
			
		ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ХарактеристикаПоЦО(СсылкаНаОбъект); 
		
		Если НЕ ХарактеристикаНоменклатуры = Неопределено Тогда
				
			ОтветСтруктура.type = "Справочник.ХарактеристикиНоменклатуры";
			
			Гуид = Строка(ХарактеристикаНоменклатуры.УникальныйИдентификатор());
			
			ОтветСтруктура.Ref = Гуид;
			
		КонецЕсли;
		
	ИначеЕсли type = "Справочник.СтатьиДвиженияДенежныхСредств" Тогда
		ОтветСтруктура.Вставить("ИмяПредопределенныхДанных", СокрЛП(СсылкаНаОбъект.ИмяПредопределенныхДанных));
		
	КонецЕсли;

	ОтветСтруктура.Вставить("Predefined", Ложь);
	Если СсылкаНаОбъект.Предопределенный Тогда
		ОтветСтруктура.Вставить("PredefinedName", СокрЛП(СсылкаНаОбъект.ИмяПредопределенныхДанных));
		ОтветСтруктура.Вставить("Predefined", Истина);
	КонецЕсли;
	
	Возврат ОтветСтруктура;
	
КонецФункции

Функция СоздатьУзелIdentification_Документа(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура("type", "");
	
	// может быть пустая ссылка! ее надо типизировать и выгрузить в json
	
	Если СсылкаНаОбъект = Неопределено или СсылкаНаОбъект = null Тогда                          
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	// тип нужен для случая наличия нескольких типов в реквизите
	ОтветСтруктура.type = СсылкаНаОбъект.Метаданные().ПолноеИмя();
		
	Если не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;

	ОтветСтруктура.Вставить("Ref", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
	ОтветСтруктура.Вставить("Version", Строка(СсылкаНаОбъект.ВерсияДанных));
	
	// 2023-11-15 не надо добавлять лишние атрибуты. боремся за производительность
	//ОтветСтруктура.Вставить("Number", СсылкаНаОбъект.Номер);
	//ОтветСтруктура.Вставить("Date", XMLСтрока(СсылкаНаОбъект.Дата));
	
	Возврат ОтветСтруктура;
	
КонецФункции

Функция СоздатьУзелIdentification_ПВХ(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура("type", "");
	
	Если СсылкаНаОбъект = Неопределено или СсылкаНаОбъект = null Тогда                          
		Возврат ОтветСтруктура;
	КонецЕсли;

	ОтветСтруктура.type = СсылкаНаОбъект.метаданные().ПолноеИмя();
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("Ref", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
	ОтветСтруктура.Вставить("Version", Строка(СсылкаНаОбъект.ВерсияДанных));

	Возврат ОтветСтруктура;
	
КонецФункции



Функция СоздатьУзелDefinition(СсылкаНаОбъект) Экспорт
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелDefinition_Перечисления(СсылкаНаОбъект);
		
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелDefinition_Справочника(СсылкаНаОбъект);
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелDefinition_Документа(СсылкаНаОбъект);

	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		Возврат СоздатьУзелDefinition_ПВХ(СсылкаНаОбъект);

	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция СоздатьУзелDefinition_Перечисления(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура;
	
	Возврат ОтветСтруктура;
	
КонецФункции                                         

Функция СоздатьУзелDefinition_Справочника(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("DeletionMark", СсылкаНаОбъект.ПометкаУдаления);
	
	мд = СсылкаНаОбъект.метаданные();
	
	Если мд.ДлинаКода > 0 Тогда
		ОтветСтруктура.Вставить("Code", СсылкаНаОбъект.Код);
	Иначе 
		ОтветСтруктура.Вставить("Code", "");
	КонецЕсли;
		
	Если мд.ДлинаНаименования > 0 Тогда
		ОтветСтруктура.Вставить("Description", СсылкаНаОбъект.Наименование);
	Иначе 
		ОтветСтруктура.Вставить("Description", "");
	КонецЕсли;
		
	Если мд.Владельцы.Количество() > 0 Тогда
		Попытка		
			owner = СоздатьУзелIdentification_Справочника(СсылкаНаОбъект.Владелец);
			ОтветСтруктура.Вставить("Owner", owner);
		Исключение
		    
		КонецПопытки;		
	КонецЕсли;
	
	ОтветСтруктура.Вставить("Predefined", Ложь);
	Если СсылкаНаОбъект.Предопределенный Тогда
		ОтветСтруктура.Вставить("PredefinedName", СокрЛП(СсылкаНаОбъект.ИмяПредопределенныхДанных));
		ОтветСтруктура.Вставить("Predefined", Истина);
	КонецЕсли;

	Если мд.Иерархический = Истина Тогда
		ОтветСтруктура.Вставить("isFolder", СсылкаНаОбъект.ЭтоГруппа);
		parent = СоздатьУзелIdentification_Справочника(СсылкаНаОбъект.Родитель);
		ОтветСтруктура.Вставить("Parent", parent);
	Иначе 
		ОтветСтруктура.Вставить("isFolder", false);
	КонецЕсли;
	
	
	
	Возврат ОтветСтруктура;
	
КонецФункции

Функция СоздатьУзелDefinition_Документа(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("DeletionMark", СсылкаНаОбъект.ПометкаУдаления);
	
	ОтветСтруктура.Вставить("isPosted", СсылкаНаОбъект.Проведен);
	
	ОтветСтруктура.Вставить("Number", СсылкаНаОбъект.Номер);
	ОтветСтруктура.Вставить("Date", XMLСтрока(СсылкаНаОбъект.Дата));
	
	Возврат ОтветСтруктура;
	
КонецФункции

Функция СоздатьУзелDefinition_ПВХ(СсылкаНаОбъект) Экспорт
	
	ОтветСтруктура = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат ОтветСтруктура;
	КонецЕсли;
	
	ОтветСтруктура.Вставить("DeletionMark", СсылкаНаОбъект.ПометкаУдаления);
	
	мд = СсылкаНаОбъект.метаданные();
	
	Если мд.ДлинаКода > 0 Тогда
		ОтветСтруктура.Вставить("Code", СсылкаНаОбъект.Код);
	Иначе 
		ОтветСтруктура.Вставить("Code", "");
	КонецЕсли;
		
	Если мд.ДлинаНаименования > 0 Тогда
		ОтветСтруктура.Вставить("Description", СсылкаНаОбъект.Наименование);
	Иначе 
		ОтветСтруктура.Вставить("Description", "");
	КонецЕсли;

	Если мд.Иерархический = Истина Тогда
		ОтветСтруктура.Вставить("isFolder", СсылкаНаОбъект.ЭтоГруппа);
		parent = СоздатьУзелIdentification_Справочника(СсылкаНаОбъект.Родитель);
		ОтветСтруктура.Вставить("Parent", parent);
	Иначе 
		ОтветСтруктура.Вставить("isFolder", false);
	КонецЕсли;
	
	
	Возврат ОтветСтруктура;
	
КонецФункции



#Область Служебные

// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция НайтиЗначениеПеречисленияПоПредставлению(ЗначениеПеречисления)
	
	МД = ЗначениеПеречисления.Метаданные().ЗначенияПеречисления;
	Для каждого Значение Из МД Цикл
		Если Значение.Синоним = Строка(ЗначениеПеречисления) Тогда
			Возврат Значение.Имя;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Архив


//// Описание_метода
////
//// Параметры:
////	Параметр1 	- Тип1 - 
////
//// Возвращаемое значение:
////	Тип: Тип_значения
////
//Функция СоздатьУзел(СсылкаНаОбъект) Экспорт
//	
//	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
//		Возврат СоздатьУзелПеречисления(СсылкаНаОбъект);
//	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
//		Возврат СоздатьУзелСправочника(СсылкаНаОбъект);
//	КонецЕсли;
//		
//	Возврат Неопределено;
//	
//КонецФункции

//Функция СоздатьУзелПеречисления(СсылкаНаОбъект) Экспорт
//	
//	ОтветСтруктура = Новый Структура;
//	ОтветСтруктура.Вставить("type", СсылкаНаОбъект.Метаданные().ПолноеИмя());
//	ОтветСтруктура.Вставить("Значение", Строка(СсылкаНаОбъект));
//	
//	Возврат ОтветСтруктура;
//	
//КонецФункции                                         

//Функция СоздатьУзелСправочника(СсылкаНаОбъект) Экспорт
//	
//	ОтветСтруктура = Новый Структура;
//	ОтветСтруктура.Вставить("type", СсылкаНаОбъект.Метаданные().ПолноеИмя());
//	ОтветСтруктура.Вставить("Ref", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
//	
//	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
//		ОтветСтруктура.Вставить("DeletionMark", СсылкаНаОбъект.ПометкаУдаления);
//		Попытка
//			ОтветСтруктура.Вставить("Code", СсылкаНаОбъект.Код);
//		Исключение
//		    ОтветСтруктура.Вставить("Code", "");
//		КонецПопытки;
//		Попытка
//			ОтветСтруктура.Вставить("Description", СсылкаНаОбъект.Наименование);
//		Исключение
//		    ОтветСтруктура.Вставить("Description", "");
//		КонецПопытки;
//	КонецЕсли;
//	
//	Возврат ОтветСтруктура;
//	
//КонецФункции

//Функция СоздатьУзелДокумента(СсылкаНаОбъект) Экспорт
//	
//	ОтветСтруктура = Новый Структура;
//	ОтветСтруктура.Вставить("type", СсылкаНаОбъект.Метаданные().ПолноеИмя());
//	ОтветСтруктура.Вставить("Ref", Строка(СсылкаНаОбъект.УникальныйИдентификатор()));
//	
//	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
//		ОтветСтруктура.Вставить("DeletionMark", СсылкаНаОбъект.ПометкаУдаления);
//		Попытка
//			ОтветСтруктура.Вставить("Code", СсылкаНаОбъект.Код);
//		Исключение
//		    ОтветСтруктура.Вставить("Code", "");
//		КонецПопытки;
//		Попытка
//			ОтветСтруктура.Вставить("Description", СсылкаНаОбъект.Наименование);
//		Исключение
//		    ОтветСтруктура.Вставить("Description", "");
//		КонецПопытки;
//	КонецЕсли;
//	
//	Возврат ОтветСтруктура;
//	
//КонецФункции

#КонецОбласти


Функция ВыгрузитьДокументПоСсылке(ДанныеСсылка) Экспорт
	ТипСсылка = Тип(СтрЗаменить(ДанныеСсылка.метаданные().ПолноеИмя(),"Документ.","ДокументСсылка."));
	Если ТипЗнч(ДанныеСсылка) = ТипСсылка Тогда
		Обк = ДанныеСсылка.ПолучитьОбъект(); 
	Иначе 
		Обк = ДанныеСсылка; 
	КонецЕсли;
	Возврат ВыгрузитьОбъектПоСсылке(Обк);
КонецФункции

Функция ВыгрузитьСправочникПоСсылке(ДанныеСсылка) Экспорт
	ТипСсылка = Тип(СтрЗаменить(ДанныеСсылка.метаданные().ПолноеИмя(),"Справочник.","СправочникСсылка."));
	Если ТипЗнч(ДанныеСсылка) = ТипСсылка Тогда
		Обк = ДанныеСсылка.ПолучитьОбъект(); 
	Иначе 
		Обк = ДанныеСсылка; 
	КонецЕсли;
	Возврат ВыгрузитьОбъектПоСсылке(Обк);
КонецФункции

Функция ВыгрузитьПВХПоСсылке(ДанныеСсылка) Экспорт
	ТипСсылка = Тип(СтрЗаменить(ДанныеСсылка.метаданные().ПолноеИмя(),"ПланВидовХарактеристик.","ПланВидовХарактеристикСсылка."));
	Если ТипЗнч(ДанныеСсылка) = ТипСсылка Тогда
		Обк = ДанныеСсылка.ПолучитьОбъект(); 
	Иначе 
		Обк = ДанныеСсылка; 
	КонецЕсли;
	Возврат ВыгрузитьОбъектПоСсылке(Обк);
КонецФункции

Функция ВыгрузитьОбъектПоСсылке(Обк) Экспорт
	
	ТипДокТоЧтоНужно = Ложь;
	Если ТипЗнч(Обк) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") 
	ИЛИ ТипЗнч(Обк) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") 
		ИЛИ ТипЗнч(Обк) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
	
		ТипДокТоЧтоНужно = Истина;
	
	КонецЕсли;
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыЗаписиJSON);
	// Это основной объект json-сообщения
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("source", "ERP");
	СтруктураОбъекта.Вставить("type", Обк.Метаданные().ПолноеИмя());
	СтруктураОбъекта.Вставить("datetime", XMLСтрока(ТекущаяДатаСеанса()));
	identification = СоздатьУзелIdentification(Обк.Ссылка);
	СтруктураОбъекта.Вставить("identification", identification);
	//	DEFINITION
	definition = СоздатьУзелDefinition(Обк.Ссылка);
	Для каждого Реквизит Из Обк.Метаданные().СтандартныеРеквизиты Цикл
		РеквизитИмя = Реквизит.Имя;
		РеквизитЗначение = Обк[РеквизитИмя];
		Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
			или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
			definition.Вставить(РеквизитИмя, РеквизитЗначение);	
		Иначе		
			definition.Вставить(РеквизитИмя, СоздатьУзелIdentification(РеквизитЗначение));	
		КонецЕсли;	
	КонецЦикла;
	Для каждого Реквизит Из Обк.Метаданные().Реквизиты Цикл
		РеквизитИмя = Реквизит.Имя;
		РеквизитЗначение = Обк[РеквизитИмя];
		Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
			или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
			definition.Вставить(РеквизитИмя, РеквизитЗначение);	
		Иначе		
			definition.Вставить(РеквизитИмя, СоздатьУзелIdentification(РеквизитЗначение));	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяТЧ Из Обк.Метаданные().ТабличныеЧасти Цикл
		ИмяТабЧасти = ИмяТЧ.Имя;
		ТЧ_Документа = Новый Массив;
		Для каждого стрк из Обк[ИмяТабЧасти] Цикл
			НовСтр = Новый Структура;
			Для каждого РеквизитТЧ из ИмяТЧ.Реквизиты Цикл
				РеквизитИмя = РеквизитТЧ.Имя;
				РеквизитЗначение = стрк[РеквизитТЧ.Имя];
				Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
					или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
					НовСтр.Вставить(РеквизитИмя,РеквизитЗначение);
				Иначе
					НовСтр.Вставить(РеквизитИмя,СоздатьУзелIdentification(РеквизитЗначение));
				КонецЕсли;
				
				Если ИмяТабЧасти = "РасшифровкаПлатежа" И РеквизитИмя = "ОбъектРасчетов" И ТипДокТоЧтоНужно Тогда
					мРеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитЗначение, "Объект, Партнер, Организация, Контрагент, Договор");
					НовСтр.Вставить("Объект",			СоздатьУзелIdentification(мРеквизитыОбъекта.Объект));
					НовСтр.Вставить("ОбъектПартнер",			СоздатьУзелIdentification(мРеквизитыОбъекта.Партнер));
					НовСтр.Вставить("ОбъектОрганизация",		СоздатьУзелIdentification(мРеквизитыОбъекта.Организация));
					НовСтр.Вставить("ОбъектКонтрагент",		СоздатьУзелIdentification(мРеквизитыОбъекта.Контрагент));
					НовСтр.Вставить("ОбъектДоговор",			СоздатьУзелIdentification(мРеквизитыОбъекта.Договор));
				КонецЕсли;
				
			КонецЦикла;
			ТЧ_Документа.Добавить(НовСтр);
		КонецЦикла;
		definition.Вставить("ТЧ"+ИмяТЧ.Имя, ТЧ_Документа);
	КонецЦикла;
	
		
	//------------------------------------------------------ ФИНАЛ
	СтруктураОбъекта.Вставить("definition", definition); 
	
	ДополнитьОбъектИнформацией(СтруктураОбъекта, Обк.Ссылка);

	
	ЗаписатьJSON(ЗаписьJson, СтруктураОбъекта);
	json = ЗаписьJson.Закрыть();
	
	Возврат json;
КонецФункции
 
Функция ВыгрузитьНаборЗаписей(НаборЗаписей) Экспорт
	
 	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
	ЗаписьJson = Новый ЗаписьJSON;
	ЗаписьJson.УстановитьСтроку(ПараметрыЗаписиJSON);
	// Это основной объект json-сообщения
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("source", "ERP");
	СтруктураОбъекта.Вставить("type", НаборЗаписей.Метаданные().ПолноеИмя());
	СтруктураОбъекта.Вставить("datetime", XMLСтрока(ТекущаяДатаСеанса()));
	identification = КСП_ЭкспортСлужебный.СоздатьУзелIdentification(НаборЗаписей);
	СтруктураОбъекта.Вставить("identification", identification);
	//	DEFINITION
	
	МассивСтруктурНабораЗаписей = Новый Массив;
	
	Свойства = Новый Массив;
	
	Свойства.Добавить("Реквизиты"); 
	Свойства.Добавить("Измерения");
	Свойства.Добавить("Ресурсы"); 
	
	ИменаРеквизитовНабораЗаписей = Новый Массив;
	
	МетаданныеРегистра = НаборЗаписей.Метаданные();
	
	Для каждого Свойство из Свойства Цикл
		
		Для каждого Строка Из МетаданныеРегистра[Свойство] Цикл
			
			ИменаРеквизитовНабораЗаписей.Добавить(Строка.Имя);
			
		КонецЦикла;
			
	КонецЦикла;
		
	Для каждого Строка из НаборЗаписей Цикл
		НовСтр = Новый Структура;
		Для каждого Реквизит из ИменаРеквизитовНабораЗаписей Цикл
			РеквизитЗначение = Строка[Реквизит];
			Если ТипЗнч(РеквизитЗначение) = Тип("Булево") или ТипЗнч(РеквизитЗначение) = Тип("Строка") или ТипЗнч(РеквизитЗначение) = Тип("Число")
				или ТипЗнч(РеквизитЗначение) = Тип("Дата") или ТипЗнч(РеквизитЗначение) = Тип("Неопределено") Тогда
				НовСтр.Вставить(Реквизит,РеквизитЗначение);
			Иначе
				НовСтр.Вставить(Реквизит,КСП_ЭкспортСлужебный.СоздатьУзелIdentification(РеквизитЗначение));
			КонецЕсли;
						
		КонецЦикла;
		МассивСтруктурНабораЗаписей.Добавить(НовСтр);
	КонецЦикла;
	
	
		
	//------------------------------------------------------ ФИНАЛ
	СтруктураОбъекта.Вставить("definition", МассивСтруктурНабораЗаписей); 
	
	//ДополнитьОбъектИнформацией(СтруктураОбъекта, Обк.Ссылка);

	
	ЗаписатьJSON(ЗаписьJson, СтруктураОбъекта);
	json = ЗаписьJson.Закрыть();
	
	Возврат json;
КонецФункции


// НЕ ИСПОЛЬЗОВАТЬ НАПРЯМУЮ (по-возможности). Вместо этого - ВыполнитьЭкспорт_ГуидовНоменклатуры() и другие
// Выгружает произвольные объекты json из массива
//
// Параметры:
//	МассивОбъектовJson	- массив - элементами являются строки, json-объекты
//	RoutingKey - строка - требуется явное указание ключа
//
Процедура ВыполнитьЭкспорт_СписокJsonИзМассива(МассивОбъектовJson, RoutingKey) Экспорт

	ИмяСобытияЖР = "ЭкспортJsonИзМассива";
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Запуск" );
	
	ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,
			"Экспорт не выполнен, т.к. ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована = Истина" );
		
		Возврат;
		
	КонецЕсли;
	
	ИмяТочкиОбмена = Константы.ксп_ТочкаОбмена.Получить().Наименование;
	
	Если Не ЗначениеЗаполнено(ИмяТочкиОбмена) Тогда
		ВызватьИсключение "Константа ксп_ТочкаОбмена не установлена!";
	КонецЕсли;	
	
	
	Клиент = Вычислить("PinkRabbit.ПолучитьКлиента()");
	
	
	Для сч = 0 По МассивОбъектовJson.Количество()-1 Цикл
		
		ОбъектJson = МассивОбъектовJson[сч];
		
		ПредставлениеОбъекта = "объект json из массива. индекс: "+строка(сч);
		
		УспешноОпубликован = Ложь;
		Попытка
			Клиент.BasicPublish(ИмяТочкиОбмена, RoutingKey, ОбъектJson, 0, Ложь);
			УспешноОпубликован = Истина;

			// для отладки
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
				"Выполнена публикация для объекта <"+ПредставлениеОбъекта+">");

		Исключение
	        т = Клиент.GetLastError();
			тт = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Ошибка,,,	
				"Ошибка публикации объекта <"+ПредставлениеОбъекта+">. Ошибка PinkRabbitMQ: "+т+символы.ПС+
				"Ошибка 1С: "+тт);
		КонецПопытки;
		
	КонецЦикла;
	
	Клиент = Неопределено;
	
	ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Длительность = ВремяКон - ВремяНач;
	ЗаписьЖурналаРегистрации(ИмяСобытияЖР,УровеньЖурналаРегистрации.Информация,,,
		"Завершение. Длительность = " + строка(Длительность) + " мс" );
	
КонецПроцедуры

// Параметры
//	НеНайденнаяНоменклатураМассив - массив - элементы: Строка, ГУИД номенклатуры
Процедура ВыполнитьЭкспорт_ГуидовНоменклатуры(НеНайденнаяНоменклатураМассив) Экспорт

//{{MRG[ <-> ]
	Если НеНайденнаяНоменклатураМассив.Количество() > 0 Тогда  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Если НеНайденнаяНоменклатураМассив.Количество() = 0 Тогда  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		возврат;
//	КонецЕсли;
//		
//	РазмерПакета = 20;
//	
//	МассивПакета = Новый Массив;
//	Для сч = 0 По НеНайденнаяНоменклатураМассив.Количество()-1 Цикл
//		ТекЭлемент = НеНайденнаяНоменклатураМассив[сч];
//		
//		МассивПакета.Добавить(ТекЭлемент);
//		
//		
//		Если сч > 0 И сч % 20 = 0 Тогда
//			// сформируем json-array
//			ЗаписьJson = Новый ЗаписьJson;
//			ЗаписьJson.УстановитьСтроку();
//			ЗаписатьJSON(ЗаписьJson, МассивПакета);
//			jsonGoods = ЗаписьJson.Закрыть();
//			
//			// добавим json-array в массив и выгрузим
//			МассивОбъектовJson = Новый Массив;
//			МассивОбъектовJson.Добавить(jsonGoods);
//			 
//			Попытка
//			    ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( МассивОбъектовJson, "goods.guid" );
//			Исключение
//			    т=ОписаниеОшибки();
//			    ЗаписьЖурналаРегистрации("ИмпортИзУПП", УровеньЖурналаРегистрации.Предупреждение,,,
//			        "Ошибка экспорта ненайденной номенклатуры из ЕРП в УПП. Подробности: "+т);
//			КонецПопытки;
//			
//			МассивПакета = Новый Массив;
//			
//		КонецЕсли;
//}}MRG[ <-> ]
		
//{{MRG[ <-> ]
		// сформируем json-array
		ЗаписьJson = Новый ЗаписьJson;
		ЗаписьJson.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJson, НеНайденнаяНоменклатураМассив);
		jsonGoods = ЗаписьJson.Закрыть();
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	КонецЦикла;  
//	
//	
//	Если  МассивПакета.Количество() > 0 Тогда  
//			// сформируем json-array
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			ЗаписьJson = Новый ЗаписьJson;
//			ЗаписьJson.УстановитьСтроку();
//			ЗаписатьJSON(ЗаписьJson, МассивПакета);
//			jsonGoods = ЗаписьJson.Закрыть();
//			
//			// добавим json-array в массив и выгрузим
//			МассивОбъектовJson = Новый Массив;
//			МассивОбъектовJson.Добавить(jsonGoods);
//			 
//			Попытка
//			    ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( МассивОбъектовJson, "goods.guid" );
//			Исключение
//			    т=ОписаниеОшибки();
//			    ЗаписьЖурналаРегистрации("ИмпортИзУПП", УровеньЖурналаРегистрации.Предупреждение,,,
//			        "Ошибка экспорта ненайденной номенклатуры из ЕРП в УПП. Подробности: "+т);
//			КонецПопытки;
//}}MRG[ <-> ]
		
		// добавим json-array в массив и выгрузим
		МассивОбъектовJson = Новый Массив;
		МассивОбъектовJson.Добавить(jsonGoods);
		 
		Попытка
		    ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( МассивОбъектовJson, "goods.guid" );
		Исключение
		    т=ОписаниеОшибки();
		    ЗаписьЖурналаРегистрации("ИмпортИзУПП", УровеньЖурналаРегистрации.Предупреждение,,,
		        "Ошибка экспорта ненайденной номенклатуры из ЕРП в УПП. Подробности: "+т);
		КонецПопытки;
	КонецЕсли;
//{{MRG[ <-> ]
//	
//}}MRG[ <-> ]

	
КонецПроцедуры

Процедура ВыполнитьЭкспорт_ГуидовКонтрагентов(мНеНайденныеКонтрагентыМассив) Экспорт

	Если мНеНайденныеКонтрагентыМассив.Количество() = 0 Тогда  
		возврат;
	КонецЕсли;
		
	ЗаписьJson = Новый ЗаписьJson;
	ЗаписьJson.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJson, мНеНайденныеКонтрагентыМассив);
	jsonGoods = ЗаписьJson.Закрыть();

	МассивОбъектовJson = Новый Массив;
	МассивОбъектовJson.Добавить(jsonGoods);
	Попытка
	    ксп_ЭкспортСлужебный.ВыполнитьЭкспорт_СписокJsonИзМассива( МассивОбъектовJson, "counterparties.guid" );
	Исключение
	    т=ОписаниеОшибки();
	    ЗаписьЖурналаРегистрации("ИмпортИзУПП", УровеньЖурналаРегистрации.Предупреждение,,,
	        "Ошибка экспорта ненайденных контрагентов из ЕРП в УПП. Подробности: "+т);
	КонецПопытки;

	
КонецПроцедуры

Процедура ДополнитьОбъектИнформацией(СтруктураОбъекта, Ссылка)
	
	Если СтруктураОбъекта.type = "Документ.ЗаказКлиента" Тогда 
		
		ДополнитьЗаказКлиентаИнформацией(СтруктураОбъекта, Ссылка);
		
	ИначеЕсли СтруктураОбъекта.type = "Документ.РасходныйОрдерНаТовары" Тогда 
		
		ДополнитьРасходныйОрдерИнформацией(СтруктураОбъекта, Ссылка);
		
	ИначеЕсли СтруктураОбъекта.type = "Справочник.Номенклатура" Тогда
		
		 ДополнитьНоменклатуруИнформацией(СтруктураОбъекта, Ссылка);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ДополнитьНоменклатуруИнформацией(СтруктураОбъекта, Ссылка)
	
	ДополнительныеДанные = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КСП_АртикулУПП.Капсула КАК Капсула,
		|	Номенклатура.КСП_АртикулУПП.Цвет КАК Цвет,
		|	Номенклатура.КоллекцияНоменклатуры КАК Коллекция,
		|	Номенклатура.КоллекцияНоменклатуры.Родитель.Родитель КАК Сезон
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДополнительныеДанные.Вставить("Капсула", Строка(РезультатЗапроса.Капсула));
		ДополнительныеДанные.Вставить("Цвет", Строка(РезультатЗапроса.Цвет));
		ДополнительныеДанные.Вставить("Коллекция", Строка(РезультатЗапроса.Коллекция));
		ДополнительныеДанные.Вставить("Сезон", Строка(РезультатЗапроса.Сезон));
		Прервать;
		
	КонецЦикла;
		
	СформироватьДополнительныеДанныеДляRabbit(СтруктураОбъекта, ДополнительныеДанные);
	
	
КонецПроцедуры

Процедура ДополнитьРасходныйОрдерИнформацией(СтруктураОбъекта, Ссылка) 
	
	Если НЕ СтруктураОбъекта.definition.ТЧТоварыПоРаспоряжениям.Количество() Тогда 
		
		Возврат;
		
	КонецЕСли;
	
	Если Не СтруктураОбъекта.definition.ТЧТоварыПоРаспоряжениям[0].Распоряжение.Свойство("type") Тогда  
		
		Возврат;
		
	ИначеЕсли НЕ СтруктураОбъекта.definition.ТЧТоварыПоРаспоряжениям[0].Распоряжение.type = "Документ.РеализацияТоваровУслуг" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеДанные = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугТовары.Характеристика КАК Характеристика,
		|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
		|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.СуммаСНДС КАК СуммаСНДС,
		|	РеализацияТоваровУслугТовары.Цена КАК Цена
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка.ТоварыПоРаспоряжениям[0].Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    ТаблицаЦен= ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса);
	
	ДополнительныеДанные.Вставить("ТЧЦеныДокумента", ТаблицаЦен);
	
	СформироватьДополнительныеДанныеДляRabbit(СтруктураОбъекта, ДополнительныеДанные);

КонецПроцедуры 

Процедура ДополнитьЗаказКлиентаИнформацией(СтруктураОбъекта, Ссылка)
	
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	СтруктураОбъекта.definition.Вставить("НомерИнтернетЗаказа","");
	СтруктураОбъекта.definition.Вставить("СтатусИнтернетЗаказа","");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ксп_ИсходныеДанныеЗаказов.id КАК id,
		|	ксп_ИсходныеДанныеЗаказов.status КАК status
		|ИЗ
		|	РегистрСведений.КСП_ИсходныеДанныеЗаказов КАК ксп_ИсходныеДанныеЗаказов
		|ГДЕ
		|	ксп_ИсходныеДанныеЗаказов.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураОбъекта.definition.НомерИнтернетЗаказа = ВыборкаДетальныеЗаписи.id; 
		СтруктураОбъекта.definition.СтатусИнтернетЗаказа = ВыборкаДетальныеЗаписи.status;

		Возврат;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры


Процедура СформироватьДополнительныеДанныеДляRabbit(СтруктураОбъекта, ДополнительныеДанные)
	
	Для каждого Данные Из ДополнительныеДанные Цикл
		
		Если ТипЗнч(Данные.Значение) = Тип("Массив") Тогда
			
			Для каждого Элемент Из Данные.Значение Цикл
				
				Для каждого Строка Из Элемент Цикл
					
					Если ТипЗнч(Строка.Значение) = Тип("Булево") 
						ИЛИ ТипЗнч(Строка.Значение) = Тип("Строка") 
						ИЛИ ТипЗнч(Строка.Значение) = Тип("Число")
						ИЛИ ТипЗнч(Строка.Значение) = Тип("Дата") 
						ИЛИ ТипЗнч(Строка.Значение) = Тип("Неопределено") Тогда
						
						Элемент.Вставить(Строка.Ключ, Строка.Значение);
						
					Иначе
						
						Элемент.Вставить(Строка.Ключ, СоздатьУзелIdentification(Строка.Значение));
						
					КонецЕсли; 
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			Если ТипЗнч(Данные.Значение) = Тип("Булево") 
				ИЛИ ТипЗнч(Данные.Значение) = Тип("Строка") 
				ИЛИ ТипЗнч(Данные.Значение) = Тип("Число")
				ИЛИ ТипЗнч(Данные.Значение) = Тип("Дата") 
				ИЛИ ТипЗнч(Данные.Значение) = Тип("Неопределено") Тогда
				
				ДополнительныеДанные.Вставить(Данные.Ключ, Данные.Значение);
				
			Иначе
				
				ДополнительныеДанные.Вставить(Данные.Ключ, СоздатьУзелIdentification(Данные.Значение));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураОбъекта.definition, ДополнительныеДанные, Истина);
	
КонецПроцедуры
